// ***** Easy *****
// 1. Тоогоор илэрхийлсэн дүн буюу n-д утга онооход түүнд харгалзах үсгийг / A,B,C,D,F / хэвлэнэ.

let n = 96;       // score = n
if (0 < n <= 100) {
    if (90 <= n && n <= 100) {
        console.log('Таны дүн:', n + "%", '\n' + 'Таны үнэлгээ: "A"');
    } else if (79 < n && n < 90) {
        console.log('Таны дүн:', n + "%", '\n' + 'Таны үнэлгээ: "B"');
    } else if (69 < n && n < 80) {
        console.log('Таны дүн:', n + "%", '\n' + 'Таны үнэлгээ: "C"');
    } else if (59 < n && n < 70) {
        console.log('Таны дүн:', n + "%", '\n' + 'Таны үнэлгээ: "D"');
    } else if (n < 60) {
        console.log('Таны дүн:', n + "%", '\n' + 'Таны үнэлгээ: "F"');
    }
} else {
    console.log("Таны score буруу байна. (0-100 хооронд)")
}
