// ***** Сурагчдын шалгалтын дүнг гаргаарай *****
// TERNARY

let name1 = "Хулан", name2 = "Оргил";
let point1 = 58, point2 = 90;
let score1, score2;

score1 = point1 < 60 ? "маш муу"
    : point1 < 70 ? "хангалттай"
        : point1 < 80 ? "дунд"
            : point1 < 90 ? "сайн"
                : point1 < 100 ? "маш сайн"
                    : "алдаатай оноо";

score2 = point2 < 60 ? "маш муу"
    : point2 < 70 ? "хангалттай"
        : point2 < 80 ? "дунд"
            : point2 < 90 ? "сайн"
                : point2 < 100 ? "маш сайн"
                    : "алдаатай оноо";

console.log("|", "нэр:", name1, "|", "авсан оноо:", point1, "|", "үнэлгээ:", score1, "|");
console.log("---------------------------------------------------");
console.log("|", "нэр:", name2, "|", "авсан оноо:", point2, "|", "үнэлгээ:", score2, "|");
